#+Title: Workshop Schedule Category Theory For Cognitive Science
#+date: 27 July 2022
* Overview of Workshop Schedule
#+CAPTION: This is a very preliminary outline
#+ATTR_HTML: :border 2 :rules all :frame border
| Time Start | Duration | Time End | Short Title                                                      | Presenters |
|------------+----------+----------+------------------------------------------------------------------+------------|
|      08:30 |     0:05 |    08:35 | Welcome/Procedural Details                                       | Britt      |
|      08:35 |     0:05 |    08:40 | Intro to the Workshop and its goals                              | Britt      |
|      08:40 |     0:25 |    09:05 | Identify Faculty/Origin Stories (5 min. each)                    | All        |
|      09:05 |     0:15 |    09:20 | A first dose of vocabulary                                       | Britt      |
|      09:20 |     0:20 |    09:40 | Exercise                                                         |            |
|      09:40 |     0:15 |    09:55 | Categorical Rules (assoc/comp/ids)                               | Britt      |
|      09:55 |     0:20 |    10:15 | Bathroom/coffee break                                            | All        |
|      10:15 |     0:15 |    10:30 | Apply the rules to the category of the exercise; discuss         | All        |
|      10:30 |     0:45 |    11:15 | Analogies as a guide to /functors/ and /natural transformations/ | Steve      |
|      11:15 |     0:45 |    12:00 | Case Study: Systematicity or Development                         | Steve      |
|      12:00 |     1:30 |    13:30 | Lunch Break                                                      | All        |
|      13:30 |     0:10 |    13:40 | Introduce the afternoon schedule                                 | Britt      |
|      13:40 |     0:50 |    14:30 | Generalizations and Hierarchies                                  | Toby       |
|      14:30 |     0:50 |    15:20 | Case Study: Reverse Differentiation/Lenses/Machine Learning      | Geoff      |
|      15:20 |     0:50 |    16:10 | Case Study: Lenses/Circuits/Predictive Coding                    | Toby       |
|      16:10 |     0:20 |    16:30 | Where to learn more: repo/readings                               | Britt      |
#+TBLFM: @<<<..@>$1=@-1$3;U::$3=$1 + $2;U

